{
  "SOJOURN": {
    "Definition": "a temporary stay, e.g. \"her sojourn in Rome\"."
  },
  "‍LOCK IN": {
    "Definition": "to get and keep an advantage such as a low price"
  },
  "‍GASTRONOMY": {
    "Definition": "the art and knowledge involved in preparing and eating good food"
  },
  "‍POPULARISED": {
    "Definition": "made popular"
  },
  "‍EARL": {
    "Definition": "(the title of) a British man of high social rank, between a marquis and a viscount"
  },
  "‍SERIAL": {
    "Definition": "used to describe someone who does something several times or repeatedly"
  },
  "‍HABITUAL": {
    "Definition": "repeated, frequent"
  },
  "‍BINGE": {
    "Definition": "an occasion when an activity is done in an extreme way, especially eating, drinking, or spending money"
  },
  "‍WRAPPED": {
    "Definition": "covered with paper or other material"
  },
  "‍BIOGRAPHY": {
    "Definition": "the life story of a person written by someone else"
  },
  "‍COMMITMENT": {
    "Definition": "willingness to give your time and energy to a job, activity, or something that you believe in"
  },
  "‍CULINARY": {
    "Definition": "connected with cooking or kitchens"
  },
  "‍GENIUS": {
    "Definition": "a person with very great and rare natural ability or skill, especially in a particular area such as science or art"
  },
  "‍FILLINGS": {
    "Definition": "the layer of food inside a sandwich, cake, etc"
  },
  "‍PREDATE": {
    "Definition": "to have existed or happened before another thing"
  },
  "‍OUT OF THIN AIR": {
    "Definition": "from nothing, e.g. \"I can't come up with €10,000 out of thin air.\""
  },
  "‍MEZZE": {
    "Definition": "a selection of small dishes served as appetizers in parts of the Middle East, the Balkans, Turkey, Greece, and North Africa"
  },
  "‍PLATTERS": {
    "Definition": "a large plate used for serving food or a meal with one type of food served on a large plate"
  },
  "‍SANDWICHED": {
    "Definition": "to put something or someone in a small space between two other, usually bigger, things or people"
  },
  "‍LIKELIHOOD": {
    "Definition": "the chance that something will happen"
  },
  "‍TOOK OFF": {
    "Definition": "to suddenly start to be successful or popular"
  },
  "‍FIRST MEN": {
    "Definition": "important men, likely aristocrats or rich men"
  },
  "‍BOOSTED": {
    "Definition": "to improve or increase something"
  },
  "‍THE BEST THING SINCE SLICED BREAD": {
    "Definition": "the best and most useful innovation or development invented for a long time"
  },
  "‍FIDDLY": {
    "Definition": "difficult"
  },
  "‍ICONIC": {
    "Definition": "very famous or popular, especially being considered to represent particular opinions or a particular time"
  },
  "‍LEFTOVER": {
    "Definition": "a leftover part of something is the part that has not been used or eaten when the other parts have been"
  },
  "‍WRAPPED UP": {
    "Definition": "to cover or surround something in paper, cloth, or other material"
  },
  "‍HIT": {
    "Definition": "a thing or person that is very popular or successful"
  },
  "‍ON THE GO": {
    "Definition": "very busy"
  },
  "‍NOWADAYS": {
    "Definition": "at the present time, in comparison to the past:"
  },
  "‍SOGGY": {
    "Definition": "(of things that can absorb water , especially food ) unpleasantly wet and soft"
  },
  "‍TRAVEL HACK": {
    "Definition": "clever solution for a travel related problem"
  },
  "‍AFFORDABLE": {
    "Definition": "not expensive"
  },
  "‍FOR WANT OF": {
    "Definition": "because of not having (something) because (something) does not exist or is not available"
  },
  "‍ADOPT": {
    "Definition": "to accept or start to use something new"
  },
  "‍FOUNDING FATHERS": {
    "Definition": "one of a group of men who started the United States as a country and wrote its constitution"
  },
  "‍STUFFY": {
    "Definition": "old-fashioned, formal, and boring"
  },
  "‍ARCHAIC": {
    "Definition": "of or belonging to an ancient period in history"
  },
  "‍AFRESH": {
    "Definition": "if you do something afresh, you deal with it again in a new way"
  },
  "‍HELD OFF": {
    "Definition": "to not do something immediately"
  },
  "‍ARISTOCRATIC": {
    "Definition": "a class of people who hold high social rank"
  },
  "‍MORALS": {
    "Definition": "standards"
  },
  "‍UPHOLD": {
    "Definition": "to defend or keep a principle or law"
  },
  "‍NOTABLE": {
    "Definition": "important and deserving attention , because of being very good or interesting"
  },
  "‍PERUSE": {
    "Definition": "to read through something, especially in order to find the part you are interested in"
  },
  "‍BUCKET LIST": {
    "Definition": "a list of the things that a person would like to do or achieve before they die"
  },
  "‍BOXING DAY": {
    "Definition": "in the UK and some other countries, the day after Christmas Day, which is a public holiday"
  },
  "‍PARDON": {
    "Definition": "to forgive someone for something they have said or done. This word is often used in polite expressions"
  },
  "‍PUN": {
    "Definition": "a funny use of a word or phrase that has several meanings or that sounds like another word"
  },
  "‍REPUTATION": {
    "Definition": "the opinion that people in general have about someone or something, or how much respect or admiration someone or something receives , based on past behaviour or character"
  },
  "‍FOR THAT MATTER": {
    "Definition": "used to show that a statement is true in another situation, e.g. Ming's never been to Spain, or to any European country for that matter."
  },
  "‍SALES PITCH": {
    "Definition": "a talk or a way of talking that is intended to persuade you to buy something"
  }
}